EmbeddedSystemClass/STM32F746G_Base/ESP8266/App/src/ESP8266_AT_Parser.cpp
/*
 * ESP8266_AT_Parser.cpp
 *
 *  Created on: 17/12/2016
 *      Author: Desarrollo 01
 */

#include "ESP8266_AT_Parser.h"
#include "ESP8266_FSM_Events.h"
#include "ESP8266_FSM_config.h"
#include "ESP8266_Utils.h"

extern osPoolId  eventPoolId;
extern osMessageQId eventQueueID;

typedef enum
{
    ST_PARSER_LEAD_CR = 0,
    ST_PARSER_LEAD_LF,
    ST_PARSER_PAYLOAD,
    ST_PARSER_TAIL_LF,
} esp_parser_state_t;

typedef struct
{
    uint8_t  buff[AT_PARSER_BUFF_SIZE];
    uint8_t* ntp_buff;
    uint16_t len;
    uint16_t idx;
    esp_parser_state_t state;
} esp_parser_scratchpad_t;

typedef struct
{
    char ssid_matrix[ESP8266_MAX_SSID_BUFF][ESP8266_SSID_LEN];
    uint8_t current_ssid_buffer;
} esp_ap_array;

typedef struct
{
    bool validDate;
    Time date;
} esp_date_t;


/* Private definitions */
static uint8_t esp_parser_run(void);
static uint8_t handle_complete_command(char* data, uint16_t len);
static uint8_t handle_version_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len);
static uint8_t handle_tcp_status_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len);
static uint8_t handle_ipd_receive_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len);
static uint8_t handle_ipv4_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len);
static uint8_t handle_mac_address_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len);
static uint8_t handle_ntp_receive_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len);
static uint8_t handle_access_point(esp_event_data_t* ev_data_ptr, char* data, uint16_t len);
static uint8_t handle_receive_date(esp_event_data_t* ev_data_ptr, char* data, uint16_t len);

/* Main parser scratchpad */
static esp_parser_scratchpad_t esp_parser_scratchpad;
static esp_ap_array esp_ap_list_scratchpad;
static esp_date_t esp_date;

void esp_parser_setup(void)
{
    dprintfln("[ESP] Buff length: %d", sizeof(esp_parser_scratchpad.buff));
    esp_parser_reset();

    /* Point to first element in the array of SSIDs */
    esp_ap_list_scratchpad.current_ssid_buffer = 0;
}

void esp_parser_ntp_buffer(char* dest)
{
    /* Set NTP buffer */
    esp_parser_scratchpad.ntp_buff = (uint8_t*)dest;
}

void esp_parser_loop(void)
{
    while (0 < ESP8266_UART.available())
    {
        uint8_t free_space = sizeof(esp_parser_scratchpad.buff) - esp_parser_scratchpad.len;

        /* If there is enough space on the buffer */
        if (0 < free_space)
        {
            /* Copy data into the buffer */
            uint8_t bytes_read = ESP8266_UART.readBytesUntil('\n', &esp_parser_scratchpad.buff[esp_parser_scratchpad.len], free_space);

            if(0 < bytes_read)
            {
                /* Increase length */
                esp_parser_scratchpad.len += bytes_read;

                /* Add <CR> character to buffer, it is not added by the readBytesUntil function */
                char last_char = esp_parser_scratchpad.buff[esp_parser_scratchpad.len-1];
                if ('\r' == last_char)
                {
                    esp_parser_scratchpad.buff[esp_parser_scratchpad.len] = '\n';
                    esp_parser_scratchpad.len++;
                }

                /* Execute parser */
                esp_parser_run();
            }
        }
        else
        {
            dprintln("[ESP] Buffer overflow: ");
           esp_parser_reset();
        }

    }
}

/* Reset buffer and counters */
void esp_parser_reset(void)
{
    /* Reset parser buffer */
    memset(&esp_parser_scratchpad.buff[0], 0, sizeof(esp_parser_scratchpad.buff));
    esp_parser_scratchpad.len = 0;
    esp_parser_scratchpad.idx = 0;

    /* Reset parser FSM */
    esp_parser_scratchpad.state = ST_PARSER_LEAD_CR;
}

static uint8_t esp_parser_run(void)
{
    /* Return value */
    uint8_t ret = 1;

    uint8_t cur_char;

    /* cmd_start_idx marks the start of the message */
    uint16_t start_cmd_idx;

    for (start_cmd_idx = 0; esp_parser_scratchpad.idx < esp_parser_scratchpad.len; esp_parser_scratchpad.idx++)
    {
        cur_char = *(&esp_parser_scratchpad.buff[esp_parser_scratchpad.idx]);

        if ('>' == cur_char)
        {
            {
                /* Cursor received, restart parser */
        		esp_event_data_t *ev_data = (esp_event_data_t*)osPoolAlloc(eventPoolId);
        		ev_data->ev = AT_EV_TCP_CURSOR;
        		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data, osWaitForever))
        		{
        			osPoolFree(eventPoolId, ev_data);
        		}

                esp_parser_scratchpad.state = ST_PARSER_LEAD_CR;
            }

            continue;
        }

        switch (esp_parser_scratchpad.state)
        {
            case ST_PARSER_LEAD_CR:
            {
                // Parse until the \r character, then look for the
                // \n character, to represent the start of the response.
                // Any other characters are ignored in this state and
                // may be received from the modem if echo is enabled
                // or otherwise.
                if ('\r' == cur_char)
                {
                    esp_parser_scratchpad.state = ST_PARSER_LEAD_LF;
                }
                else if((cur_char >= ' ') && (cur_char <= '~'))
                {
                    esp_parser_scratchpad.state  = ST_PARSER_PAYLOAD;
                    start_cmd_idx = esp_parser_scratchpad.idx;
                }
                break;
            }
            case ST_PARSER_LEAD_LF:
            {
                if ('\n' == cur_char)
                {
                    esp_parser_scratchpad.state  = ST_PARSER_PAYLOAD;
                    start_cmd_idx = esp_parser_scratchpad.idx + 1;
                }
                else if ('\r' != cur_char)
                {
                    // If we are here there was an \r previously
                    // but no subsequent \n.  Therefore this is not
                    // the start of a response for this module to
                    // announce.  If it is a '\r' then stay in the
                    // same state expecting a '\n' next.  Otherwise,
                    // reset and look for the 'r' again.
                    esp_parser_scratchpad.state = ST_PARSER_LEAD_CR;
                }
                else if((cur_char >= ' ') && (cur_char <= '~'))
                {
                    esp_parser_scratchpad.state  = ST_PARSER_PAYLOAD;
                    start_cmd_idx = esp_parser_scratchpad.idx;
                }
                break;
            }
            case ST_PARSER_PAYLOAD:
            {
                // If the \r character is read, consider that to
                // be the end of expecting the response payload
                if ('\r' == cur_char)
                {
                    esp_parser_scratchpad.state = ST_PARSER_TAIL_LF;
                }
                break;
            }
            case ST_PARSER_TAIL_LF:
            {
                if ('\n' == cur_char)
                {
                    uint16_t data_len = esp_parser_scratchpad.idx - start_cmd_idx - 1;

                    if (data_len > 0)
                    {
                        if(data_len > sizeof(esp_parser_scratchpad.buff))
                        {
                            /* ERROR */
                        }

                        esp_parser_scratchpad.state = ST_PARSER_LEAD_CR;

                        // Process the completed command, which handles
                        // transitioning states, depending on the contents
                        // of the complete command.

                        ret = handle_complete_command((char*)&esp_parser_scratchpad.buff[start_cmd_idx], data_len);
                    }
                    else
                    {
                        // If a zero length command is received, this is \r\n\r\n
                        // from the modem.  In this condition, treating the second
                        // set of delimiters as being a start of message instead,
                        // looking for payload after the second \r\n.  Therefore,
                        // changing state to AT_PARSER_EXPECTING_RESPONSE_PAYLOAD
                        // and resetting the index of the potential start of
                        // command.

                        esp_parser_scratchpad.state = ST_PARSER_PAYLOAD;
                        start_cmd_idx = esp_parser_scratchpad.idx + 1;
                    }

