EmbeddedSystemClass/STM32F746G_Base/ESP8266/App/src/ESP8266_AT_Parser.cpp
                }
                else if ('\r' != cur_char)
                {
                    // If we are here there was an \r previously
                    // but no subsequent \n.  Therefore this is not
                    // the end of a response for this module to
                    // announce.  If it is a '\r' then stay in the
                    // same state expecting a '\n' next.  Otherwise,
                    // consider all this as part of the payload.
                    esp_parser_scratchpad.state = ST_PARSER_PAYLOAD;

                    /* ERROR */
                }

                break;
            }
        }
    }

    if(1 == ret)
    {
        uint16_t bytes_to_keep = esp_parser_scratchpad.len - start_cmd_idx;

        /***************************************************************************
         * There are bytes to keep and we are in the expecting response
         * payload state or expecting tail LF state.
         * Save the mid-parsing AT command content for the next execute call.
         **************************************************************************/
        if ((0 != bytes_to_keep) && ((ST_PARSER_PAYLOAD == esp_parser_scratchpad.state) || (ST_PARSER_TAIL_LF == esp_parser_scratchpad.state)))
        {
            /* Trim buffer */
            memcpy(&esp_parser_scratchpad.buff[0], &esp_parser_scratchpad.buff[start_cmd_idx], bytes_to_keep);

            /* Fill unused buffer space with zeros */
            memset(&esp_parser_scratchpad.buff[bytes_to_keep], 0, sizeof(esp_parser_scratchpad.buff) - esp_parser_scratchpad.len);

            /* Reset the parse index and length to the adjusted buffer, for future UART data. */
            esp_parser_scratchpad.len = bytes_to_keep;
            esp_parser_scratchpad.idx = bytes_to_keep;
        }
        else
        {
            /* Reset the parser */
            esp_parser_reset();
        }
    }

    return ret;
}

static uint8_t handle_complete_command(char* data, uint16_t len)
{
    uint8_t ret = 1;
    esp_event_data_t *ev_data = (esp_event_data_t*)osPoolAlloc(eventPoolId);
    ev_data->ev = AT_EV_INVALID;

#if ESP8266_AT_PARSER_DBG == 1
    dprint(("[ESP-PAR] Rx << "));
    dwrite(data, len);
    dprintln();
#endif

    if((len >= strlen("OK")) && (0 == memcmp(data, "OK", strlen("OK"))))
    {
        ev_data->ev = AT_EV_OK;
		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    else if((len >= strlen("ready")) && (0 == memcmp(data, "ready", strlen("ready"))))
    {
        ev_data->ev = AT_EV_READY;
		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    else if((len >= strlen("busy")) && (0 == memcmp(data, "busy", strlen("busy"))))
    {
        ev_data->ev = AT_EV_BUSY;
		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    else if((len >= strlen("ERROR")) && (0 == memcmp(data, "ERROR", strlen("ERROR"))))
    {
        ev_data->ev = AT_EV_ERROR;
		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    else if((len >= strlen("FAIL")) && (0 == memcmp(data, "FAIL", strlen("FAIL"))))
    {
        ev_data->ev = AT_EV_FAIL;
		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    else if((len >= strlen("CONNECT")) && (0 == memcmp(data, "CONNECT", strlen("CONNECT"))))
    {
        ev_data->ev = AT_EV_TCP_CONNECT;
		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    else if((len >= strlen("ALREADY CONNECTED")) && (0 == memcmp(data, "ALREADY CONNECTED", strlen("ALREADY CONNECTED"))))
    {
        ev_data->ev = AT_EV_TCP_ALREADY_CONNECT;
		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    else if((len >= strlen("CLOSED")) && (0 == memcmp(data, "CLOSED", strlen("CLOSED"))))
    {
        ev_data->ev = AT_EV_TCP_CLOSED;
		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    else if((len >= strlen("SEND OK")) && (0 == memcmp(data, "SEND OK", strlen("SEND OK"))))
    {
        ev_data->ev = AT_EV_TCP_SENDOK;
		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    else if((len >= strlen("SEND FAIL")) && (0 == memcmp(data, "SEND FAIL", strlen("SEND FAIL"))))
    {
        ev_data.ev = AT_EV_TCP_SEND_ERROR;
        ev_data->ev = AT_EV_READY;
		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    else if((len >= strlen("STATUS:")) && (0 == memcmp(data, "STATUS:", strlen("STATUS:"))))
    {
        ret = handle_tcp_status_data(ev_data, data, len);
    }
    else if((len >= strlen("+CIPSTATUS:")) && (0 == memcmp(data, "+CIPSTATUS:", strlen("+CIPSTATUS:"))))
    {
        ret = 1; /* Do nothing, its just the ACK from the +CIPSTATUS command */
    }
    else if((len >= strlen("AT version")) && (0 == memcmp(data, "AT version", strlen("AT version"))))
    {
        ret = handle_version_data(ev_data, data, len);
    }
    else if((len >= strlen("+IPD,48:")) && (0 == memcmp(data, "+IPD,48:", strlen("+IPD,48:"))))
    {
        ret = handle_ntp_receive_data(ev_data, data + 8, len - 8);
    }
    else if((len >= strlen("+IPD")) && (0 == memcmp(data, "+IPD", strlen("+IPD"))))
    {
        ret = handle_ipd_receive_data(ev_data, data, len);
    }
    else if((len >= strlen("+CIFSR:STAIP,")) && (0 == memcmp(data, "+CIFSR:STAIP,", strlen("+CIFSR:STAIP,"))))
    {
        ret = handle_ipv4_data(ev_data, data, len);
    }
    else if((len >= strlen("+CIFSR:STAMAC,")) && (0 == memcmp(data, "+CIFSR:STAMAC,", strlen("+CIFSR:STAMAC,"))))
    {
        ret = handle_mac_address_data(ev_data, data, len);
    }
    else if((len >= strlen("+CWLAP:")) && (0 == memcmp(data, "+CWLAP:", strlen("+CWLAP:"))))
    {
        ret = handle_access_point(ev_data, data, len);
    }
    else if((len >= strlen("Recv ")) && (0 == memcmp(data, "Recv ", strlen("Recv "))))
    {
        ret = 1; /* Do nothing, its just the ACK from the SEND command */
    }
    else if((len >= strlen("Date: ")) && (0 == memcmp(data, "Date: ", strlen("Date: "))))
    {
        ret = handle_receive_date(ev_data, data, len);
    }
    /* Avoid empty space */
    else if(!((1 == len) && (*data == ' ')))
    {
        /* Command not found, unexpected data */
        dprint(("[ESP-PAR] << "));
        dwrite(data, len);
        dprint(" [");
        printHex((uint8_t*)data, len);
        dprint("]");
        dprintln();
    }

    if (AT_EV_INVALID == ev_data->ev)
    {
		osPoolFree(eventPoolId, ev_data);
    }

    return ret;
}

static uint8_t handle_version_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len)
{
    uint8_t ret = 1;
    ev_data_ptr->ev = AT_EV_VERSION;

    /* TODO: Parse event data */

    if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data_ptr, osWaitForever))
	{
		osPoolFree(eventPoolId, ev_data);
	}

	return ret;
}

static uint8_t handle_tcp_status_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len)
{
    uint8_t ret = 0;
    char* cpStatus = NULL;
    int val = 0;

    if (ev_data_ptr != NULL)
    {
        /* Clear event data field before writing to it */
        memset((void *) ev_data_ptr->data, 0x00, sizeof(ev_data_ptr->data));

        /* Set starting point */
        cpStatus = strchr(data, ':');

        if(NULL != cpStatus)
        {
            cpStatus++;

