EmbeddedSystemClass/STM32F746G_Base/ESP8266/App/src/ESP8266_AT_Parser.cpp
            if ('2' <= *cpStatus && '5' >= *cpStatus)
            {
                ev_data_ptr->data[0] = (uint8_t)(*cpStatus - '0');
            }
#if ESP8266_AT_PARSER_DBG == 1
            dprint("[ESP] CIP status << ");
            dwrite(data, len);
            dprintln();
            dprintfln("[ESP] CIP status << %d", ev_data_ptr->data[0]);
#endif
        }

        /* Queue event */
        ev_data_ptr->ev = AT_EV_TCP_STATUS;

		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data_ptr, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}

        ret = 1;
    }
    return ret;
}

static uint8_t handle_ipd_receive_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len)
{
    uint8_t ret = 0;
    uint32_t dataFieldSize = sizeof(esp_event_data_t) - sizeof(esp_event_t);
    int16_t httpStatus = 0;
    char tmpBuffer[8];

    if (ev_data_ptr != NULL)
    {
        ev_data_ptr->ev = AT_EV_TCP_IPD;

        dprint(("[ESP-IPD] << "));
        dwrite(data, len);
        dprintln();

        /* Clear event data field before writing to it */
        memset((void *) ev_data_ptr->data, 0x00, dataFieldSize);
        /* Get connection status from response */
        if (get_word_from_line(data, len, ' ', ' ', tmpBuffer))
        {
            httpStatus = (int16_t)atoi(tmpBuffer);
            /* validate httpStatus range */
            if ((0 < httpStatus) && (600 > httpStatus))
            {
                *(int16_t *)&ev_data_ptr->data = httpStatus;
                ret = 1;
            }
        }

		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data_ptr, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    return ret;
}

static uint8_t handle_ntp_receive_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len)
{
    uint8_t ret = 0;
    if (ev_data_ptr != NULL)
    {
        ev_data_ptr->ev = AT_EV_TCP_IPD;

        dprintfln("*** IPD data len: %d", len);

        /* Clear event data field before writing to it */
        memset(esp_parser_scratchpad.ntp_buff, 0x00, 48);

        /* Fill buffer */
        memcpy(esp_parser_scratchpad.ntp_buff, data, 48);

		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data_ptr, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}

        ret = 1;
    }
    return ret;
}

static uint8_t handle_access_point(esp_event_data_t* ev_data_ptr, char* data, uint16_t len)
{
    uint8_t ret = 0;
    if (ev_data_ptr != NULL)
    {
        ev_data_ptr->ev = AT_EV_WIFI_CWLAP;
        /* Equivalent to NULL address / NULL pointer  */
        *(uint32_t *)(&ev_data_ptr->data[0]) = 0;
        /* Clear event data field before writing to it */
        memset((void *) (&esp_ap_list_scratchpad.ssid_matrix[esp_ap_list_scratchpad.current_ssid_buffer][0]), 0x00, ESP8266_SSID_LEN);
        /* Get SSID name and store in selected buffer */
        if (get_word_from_line(data, len, '"', '"', (&esp_ap_list_scratchpad.ssid_matrix[esp_ap_list_scratchpad.current_ssid_buffer][0])))
        {
            /* Pass as first data, the address where this SSID was stored */
            *(uint32_t *)(&ev_data_ptr->data[0]) = (uint32_t)(&esp_ap_list_scratchpad.ssid_matrix[esp_ap_list_scratchpad.current_ssid_buffer++][0]);
            /* Where are in the last array? if so, reset index buffer */
            if (ESP8266_MAX_SSID_BUFF <= esp_ap_list_scratchpad.current_ssid_buffer)
            {
                esp_ap_list_scratchpad.current_ssid_buffer = 0;
            }
            ret = 1;
        }

		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data_ptr, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    return ret;
}

static uint8_t handle_ipv4_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len)
{
    uint8_t ret = 0;
    uint8_t tempOctet = 0;
    uint8_t idx = 0;
    char* nextDot = NULL;
    char* prevDot = NULL;

#if ESP8266_AT_PARSER_DBG == 1
    dprint("[ESP] IP event << ");
    dwrite(data, len);
    dprintln();
#endif

    int val = 0;

    /* WWW.XXX.YYY.ZZZ\0 */
    char tmpBuffer[16];

    if (ev_data_ptr != NULL)
    {
        /* Fill buffer with zeroes */
        memset(tmpBuffer, 0x00, sizeof(tmpBuffer));

        /* Clear event data field before writing to it */
        ev_data_ptr->ev = AT_EV_LOCAL_IP;
        memset((void *) ev_data_ptr->data, 0x00, sizeof(ev_data_ptr->data));

        /* Get IP value from response */
        if (get_word_from_line(data, len, '"', '"', tmpBuffer))
        {
            /* Set starting point */
            prevDot = &tmpBuffer[0];

#if ESP8266_AT_PARSER_DBG == 1
            dprintfln("tmpBuffer = %s", (char*)&tmpBuffer[0]);
#endif

            /* Parse 4 octets */
            for(idx = 0; idx < 4; idx++)
            {
                /* Get octets */
                nextDot = strchr(prevDot, '.');

#if ESP8266_AT_PARSER_DBG == 1
                dprintfln("prevDot = %d", prevDot);
                dprintfln("nextDot = %d", nextDot);
#endif
                /* First 3 octets */
                if(NULL != nextDot)
                {
                    if(1 == string_to_int(prevDot, &val, (nextDot - prevDot), 1, 0))
                    {
                        prevDot = nextDot + 1;
                        ev_data_ptr->data[idx] = (uint8_t)val;
                    }
                }
                /* Last octet (4th)*/
                else if(3 == idx)
                {
                    if(1 == string_to_int(prevDot, &val, strlen(prevDot), 1, 0))
                    {
                        ev_data_ptr->data[idx] = (uint8_t)val;
                        /* Last octet parsed correctly, parse was successful */
                        ret = 1;
                    }
                }
                /* Error, abort parsing */
                else
                {
                    /* Send data empty */
                    memset((void *) ev_data_ptr->data, 0x00, sizeof(ev_data_ptr->data));
                    break;
                }

#if ESP8266_AT_PARSER_DBG == 1
                dprintfln("Octet #%d = %d", idx, val);
#endif
            }
        }

#if ESP8266_AT_PARSER_DBG == 1
        dprint("[ESP] IP Data << ");
        printHex(&ev_data_ptr->data[0], sizeof(ev_data_ptr->data));
        dprintln();
#endif

		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data_ptr, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    return ret;
}

static uint8_t handle_mac_address_data(esp_event_data_t* ev_data_ptr, char* data, uint16_t len)
{
    uint8_t ret = 0;
    uint8_t tempOctet = 0;
    uint8_t idx = 0;
    char* nextDot = NULL;
    char* prevDot = NULL;

#if ESP8266_AT_PARSER_DBG == 1
    dprint("[ESP] MAC event << ");
    dwrite(data, len);
    dprintln();
#endif

    int val = 0;

