EmbeddedSystemClass/STM32F746G_Base/ESP8266/App/src/ESP8266_AT_Parser.cpp
    /* AA:BB:CC:DD:EE:FF \0 */
    char tmpBuffer[18];

    if (ev_data_ptr != NULL)
    {
        /* Fill buffer with zeroes */
        memset(tmpBuffer, 0x00, sizeof(tmpBuffer));

        /* Clear event data field before writing to it */
        ev_data_ptr->ev = AT_EV_LOCAL_MAC;
        memset((void *) ev_data_ptr->data, 0x00, sizeof(ev_data_ptr->data));

        /* Get IP value from response */
        if (get_word_from_line(data, len, '"', '"', tmpBuffer))
        {
            /* Set starting point */
            prevDot = &tmpBuffer[0];

#if ESP8266_AT_PARSER_DBG == 1
            dprintfln("tmpBuffer = %s", (char*)&tmpBuffer[0]);
#endif

            /* Parse 4 octets */
            for(idx = 0; idx < 6; idx++)
            {
                /* Get octets */
                nextDot = strchr(prevDot, ':');

#if ESP8266_AT_PARSER_DBG == 1
                dprintfln("prevDot = %d", prevDot);
                dprintfln("nextDot = %d", nextDot);
#endif
                /* First 3 octets */
                if(NULL != nextDot)
                {
                    if(1 == hex_string_to_int(prevDot, &val, (nextDot - prevDot), 1, 0))
                    {
                        prevDot = nextDot + 1;
                        ev_data_ptr->data[idx] = (uint8_t)val;
                    }
                }
                /* Last octet (4th)*/
                else if(5 == idx)
                {
                    if(1 == hex_string_to_int(prevDot, &val, strlen(prevDot), 1, 0))
                    {
                        ev_data_ptr->data[idx] = (uint8_t)val;
                        /* Last octet parsed correctly, parse was successful */
                        ret = 1;
                    }
                }
                /* Error, abort parsing */
                else
                {
                    /* Send data empty */
                    memset((void *) ev_data_ptr->data, 0x00, sizeof(ev_data_ptr->data));
                    break;
                }

#if ESP8266_AT_PARSER_DBG == 1
                dprintfln("Address byte #%d = %d", idx, val);
#endif
            }
        }

#if ESP8266_AT_PARSER_DBG == 1
        dprint("[ESP] MAC Data << ");
        printHex(&ev_data_ptr->data[0], sizeof(ev_data_ptr->data));
        dprintln();
#endif

		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data_ptr, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    return ret;
}


static uint8_t handle_receive_date(esp_event_data_t* ev_data_ptr, char* data, uint16_t len)
{
    String date = String(data);
    Time *timePtr = &esp_date.date;

#if ESP8266_AT_PARSER_DBG == 1
    dprintf("[ESP_PARSER] Date buffer: %s\r\n", data);
#endif

    /* Clear date structure */
    memset((void *)timePtr, 0x00, sizeof(Time));
    esp_date.validDate = true;

    date.toUpperCase();
    // example:
    // date: Thu, 19 Nov 2015 20:25:40 GMT
    /* Parse DOW */
    String dayOfWeek = date.substring(6, 9);
    /* Day of the week */
    if (0 == strcmp("MON", dayOfWeek.c_str()))
    {
        timePtr->dow = 1;
    }
    else if (0 == strcmp("TUE", dayOfWeek.c_str()))
    {
        timePtr->dow = 2;
    }
    else if (0 == strcmp("WED", dayOfWeek.c_str()))
    {
        timePtr->dow = 3;
    }
    else if (0 == strcmp("THU", dayOfWeek.c_str()))
    {
        timePtr->dow = 4;
    }
    else if (0 == strcmp("FRI", dayOfWeek.c_str()))
    {
        timePtr->dow = 5;
    }
    else if (0 == strcmp("SAT", dayOfWeek.c_str()))
    {
        timePtr->dow = 6;
    }
    else if (0 == strcmp("SUN", dayOfWeek.c_str()))
    {
        timePtr->dow = 7;
    }
    else
    {
        esp_date.validDate = false;
        /* Something went wrong!! */
        dprint("Bad day of the week parsing");
    }

    /* Parse day */
    timePtr->date = date.substring(11, 13).toInt();

    /* Validate day */
    if ((((timePtr->date < 1) || (timePtr->date > 31))) && (!esp_date.validDate))
    {
        dprint("Bad date parsing");
    }
    else
    {
        /* Parse Month */
        String month = date.substring(14, 17);
        if (0 == strcmp("JAN", month.c_str()))
        {
            timePtr->mon = 1;
        }
        else if (0 == strcmp("FEB", month.c_str()))
        {
            timePtr->mon = 2;
        }
        else if (0 == strcmp("MAR", month.c_str()))
        {
            timePtr->mon = 3;
        }
        else if (0 == strcmp("APR", month.c_str()))
        {
            timePtr->mon = 4;
        }
        else if (0 == strcmp("MAY", month.c_str()))
        {
            timePtr->mon = 5;
        }
        else if (0 == strcmp("JUN", month.c_str()))
        {
            timePtr->mon = 6;
        }
        else if (0 == strcmp("JUL", month.c_str()))
        {
            timePtr->mon = 7;
        }
        else if (0 == strcmp("AUG", month.c_str()))
        {
            timePtr->mon = 8;
        }
        else if (0 == strcmp("SEP", month.c_str()))
        {
            timePtr->mon = 9;
        }
        else if (0 == strcmp("OCT", month.c_str()))
        {
            timePtr->mon = 10;
        }
        else if (0 == strcmp("NOV", month.c_str()))
        {
            timePtr->mon = 11;
        }
        else if (0 == strcmp("DEC", month.c_str()))
        {
            timePtr->mon = 12;
        }
        else
        {
            esp_date.validDate = false;
            /* Something went wrong!! */
            dprint("Bad month parsing");
        }

        /* Parse Year*/
        timePtr->year = date.substring(18, 22).toInt();

        /* Parse Hour, minutes and seconds (UTC) */
        timePtr->hour = date.substring(23, 25).toInt();
        timePtr->min = date.substring(26, 28).toInt();
        timePtr->sec = date.substring(29, 31).toInt();

        /* Validate values */
        if ((timePtr->hour > 23) || (timePtr->min > 59) || (timePtr->sec > 59))
        {
            dprint("Bad hour, min or sec parsing");
        }
    }
#if (ESP8266_AT_PARSER_DBG == 1)
    dprintf("Day of Week: %s\r\n",  esp_date.date.dow == 1 ? "Mon" :
                                    esp_date.date.dow == 2 ? "Tue" :
                                    esp_date.date.dow == 3 ? "Wed" :
                                    esp_date.date.dow == 4 ? "Thu" :
                                    esp_date.date.dow == 5 ? "Fri" :
                                    esp_date.date.dow == 6 ? "Sat" :
                                    esp_date.date.dow == 7 ? "Sun" : "Inv");
    dprintf("Date: %d\r\n", esp_date.date.date);
    dprintf("Month: %s\r\n",    esp_date.date.mon == 1 ? "Jan" :
                                esp_date.date.mon == 2 ? "Feb" :
                                esp_date.date.mon == 3 ? "Mar" :
                                esp_date.date.mon == 4 ? "Apr" :
                                esp_date.date.mon == 5 ? "May" :
                                esp_date.date.mon == 6 ? "Jun" :
                                esp_date.date.mon == 7 ? "Jul" :
                                esp_date.date.mon == 8 ? "Aug" :
                                esp_date.date.mon == 9 ? "Sep" :
                                esp_date.date.mon == 10 ? "Oct" :
                                esp_date.date.mon == 11 ? "Nov" :
                                esp_date.date.mon == 12 ? "Dec" : "Inv");
    dprintf("Year: %d\r\n", esp_date.date.year);
    dprintf("Hour: %d:%d:%d\r\n", esp_date.date.hour, esp_date.date.min,esp_date.date.sec);
#endif

    if ((esp_date.validDate) && (NULL != ev_data_ptr))
    {
        ev_data_ptr->ev = AT_EV_TIME;
        /* Pass as first data, the address where this time structure was stored */
        *(uint32_t *)(&ev_data_ptr->data[0]) = (uint32_t)(&esp_date.date);

		if (osOK != osMessagePut(eventQueueID, (uint32_t)ev_data_ptr, osWaitForever))
		{
			osPoolFree(eventPoolId, ev_data);
		}
    }
    return esp_date.validDate;
}

